# Pandas
### Pandas is  the powerfull tool in the python . Pandas provide different data structures like series and dataframe. series is the 1D array and datafram is the 2D data table like Excel Spreadshit. We can spliit the data by indexing using integer , We can split the specific column of the data for special operations
- Pandas done manipulation of data
- Cleaning of data
- Data analysis
- We can explore the data
## Data Structure:
- series = 1D array = pandas.Series()
- dataframe = 2D table =pandas.DataFrame()

# Series
- Pandas having 1D array say series like numpy having 1D array.
- Series Stores all data type

In [1]:
# Firtly Import the pandas module
import pandas as pd
sr = pd.Series([1,2,3,4,5,6])
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# DataFrame
- A two dimensional labled data strcuture like as table in excel worksheet.
- It Consist column and Row
- Conatins Different Data types

In [2]:
n = ['x','y','z']
w = ['45','39','50']

In [3]:
data = pd.DataFrame(list(zip(n , w)),
                    index =[1,2,3],
                    columns = ['Name','Weights'])

In [4]:
print(data)

  Name Weights
1    x      45
2    y      39
3    z      50

### INdexing And Slicing
- data['colun name']
- data.iloc[],
- data.loc[]

In [5]:
# Creating a series
ss = pd.Series([5,10,15],index=['x','y','z'])
ss

x     5
y    10
z    15
dtype: int64

In [6]:
#indexing
ss['x']

5

In [7]:
ss[1]

C:\Users\akash\AppData\Local\Temp\ipykernel_9868\1375059848.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ss[1]

10

### Selecting a single column from the dataframe using data['col']


print(data)
ss[ss>5]

In [8]:
h =data['Name']

In [9]:
h

1    x
2    y
3    z
Name: Name, dtype: object

### for selecting entire raw we using .iloc[] 
### select roes and columnd by integer position

In [10]:
print(data.iloc[0])
print(data.iloc[2])

Name        x
Weights    45
Name: 1, dtype: object
Name        z
Weights    50
Name: 3, dtype: object

### data.loc[]
- Select row and columns by leads or a boolean array

In [11]:
k ={'Min':[100,200,300],'Max':[400,500,600]}
df= pd.DataFrame(k)

In [12]:
df

   Min  Max
0  100  400
1  200  500
2  300  600

In [13]:
df.loc[0]

Min    100
Max    400
Name: 0, dtype: int64

In [14]:
data

  Name Weights
1    x      45
2    y      39
3    z      50

In [15]:
data.loc[1]

Name        x
Weights    45
Name: 1, dtype: object

# Data Preprocessing
- ### Data preprocessing contain
      - checking null values
      - finding outlier
      - Filling the missing values
      - Droping the missing value
- ### Renaming Column Name
- Filtering
- Aggregation
- Grouping

In [16]:
# Checkig null values in the data
data.isnull()

    Name  Weights
1  False    False
2  False    False
3  False    False

In [17]:
# Droping mising value
df_1 = df.dropna()
df_1

   Min  Max
0  100  400
1  200  500
2  300  600

In [18]:
# Filling the missing value
# If our data conatins missing value then we can fill it 
hh=df.fillna(0)
hh

   Min  Max
0  100  400
1  200  500
2  300  600

## Renaming Columns names

In [19]:

df.rename(columns={'Min':'Minimum','Max':'Maximum'},inplace=True) # inplace for permently

In [20]:
df

   Minimum  Maximum
0      100      400
1      200      500
2      300      600

# Filtering
    filtering rows on required condition

In [21]:
filter_data  = df[df['Maximum']>400].mean()

In [22]:
print(filter_data)

Minimum    250.0
Maximum    550.0
dtype: float64

# aggregation and Grouping
## GroupBY
- Grouping data by a column
## Aggreagation
- Sum : .sum()
- Mean : .mean()
- Count: .count()

In [23]:
# creating a dataset for below transactions
d = {
    'Name':['Akash','Vijay','Raj','kavita','namdev'],
    'City':['KOlhapur','mumbai','pune','KOlhapur','mumbai'],
    'Age':[25,45,35,29,27]
}


df =pd.DataFrame(d)

In [24]:
print("\n DataFrame")
print(df)

 DataFrame
     Name      City  Age
0   Akash  KOlhapur   25
1   Vijay    mumbai   45
2     Raj      pune   35
3  kavita  KOlhapur   29
4  namdev    mumbai   27

In [25]:
gr__city = df.groupby('City')['Age'].mean()

In [26]:

gr__city

City
KOlhapur    27.0
mumbai      36.0
pune        35.0
Name: Age, dtype: float64

In [27]:
#Sum
print(df['Age'].sum())

161

In [28]:
# count
print(df['Name'].count())
print(df['City'].count())

5
5

# Merging and Joining
## Merge
- we can combine two dataframe in once , by using the command pd.merge
## Joining .concate()
- we can join two dataframe

In [29]:
print(df)

     Name      City  Age
0   Akash  KOlhapur   25
1   Vijay    mumbai   45
2     Raj      pune   35
3  kavita  KOlhapur   29
4  namdev    mumbai   27

In [30]:
# Merging 
df2 = pd.DataFrame({
    'Name':['Akash','Raj','Jaydip','Pravin'],
    'Age': [28,29,24,23]
})

In [31]:
df2

     Name  Age
0   Akash   28
1     Raj   29
2  Jaydip   24
3  Pravin   23

In [32]:
dd = pd.merge(df,df2,on='Name',how='inner')

In [33]:
dd  # merged data

    Name      City  Age_x  Age_y
0  Akash  KOlhapur     25     28
1    Raj      pune     35     29


# File I/O:
- pd.read_csv(), df.to_csv(), pd.read_excel(), df.to_excel()
### Reading the data
- pd.read_csv()
- pd.read_excel()
### writing
- df.to_csv()
- df.to_excel

In [34]:
df

     Name      City  Age
0   Akash  KOlhapur   25
1   Vijay    mumbai   45
2     Raj      pune   35
3  kavita  KOlhapur   29
4  namdev    mumbai   27

In [35]:
df.to_csv('df_csv.csv',index=False)

In [36]:
# Reading Csv
data1 = pd.read_csv('df_csv.csv')

In [37]:
print(data1)

     Name      City  Age
0   Akash  KOlhapur   25
1   Vijay    mumbai   45
2     Raj      pune   35
3  kavita  KOlhapur   29
4  namdev    mumbai   27

In [38]:
# Excel Write
df.to_excel('df_excel.xlsx',index=False)

In [39]:
data2 = pd.read_excel('df_excel.xlsx')

In [41]:
data2

     Name      City  Age
0   Akash  KOlhapur   25
1   Vijay    mumbai   45
2     Raj      pune   35
3  kavita  KOlhapur   29
4  namdev    mumbai   27

#